# IsValid Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Entity..::..IsValid Method
Entity Class See Also
---
Checks whether this Entity has a live Schema corresponding to it.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsValid()
```

Visual Basic
---
```text
Public Function IsValid As Boolean
```

Visual C++
---
```text
public:
bool IsValid()
```

# ### Return Value
True if the Entity is valid.
# Remarks
Invalid entities may be used as token values. E.g., setting an invalid subentity is equivalent to deleting the stored one.
# See Also
Entity Class
Autodesk.Revit.DB.ExtensibleStorage Namespace